Catalogs/упСервераСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСервераСбораДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипСервераСбораДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытияМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Comment>AutoGRAPH</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьВQRКодДанныеАутентификацииНаМобильномКлиенте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактыСлужбыПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПолученияДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОтсрочкиПолученияДанныхПоСобытиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПолученияТокен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипСервераСбораДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипСервераСбораДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AndroidКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AutoGRAPH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WialonPro</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WialonHosting</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСервераСбораДанных/Forms/ФормаТокен/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТокенПользователя = "";
	СерверПолученияТокен = Параметры.СерверПолученияТокен;
	Тип = Параметры.Тип;
	
	Если Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.WialonHosting") Тогда
		Элементы.СерверПолученияТокен.ПодсказкаВвода = "hosting.wialon.com";
		СерверПолученияТокен = "hosting.wialon.com";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСтрокуHTMLДокумент();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОтключитьОбработчикОжидания("ОтправитьРезультатВладельцу");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура HTMLДокументДокументСформирован(Элемент)
	ПодключитьОбработчикОжидания("ПроверитьСостоянииеHTMLДокумент", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	#Если НЕ ВебКлиент Тогда
		Если ДанныеСобытия.Document.ReadyState="complete" ИЛИ ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
			ПодключитьОбработчикОжидания("ПроверитьСостоянииеHTMLДокумент", 3, Истина);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры // HTMLДокументПриНажатии()

&НаКлиенте
Процедура ПроверитьСостоянииеHTMLДокумент() Экспорт
	
	Если НЕ ПустаяСтрока(Элементы.HTMLДокумент.Документ.url) Тогда
		МассивСтрок = СтрРазделить(Элементы.HTMLДокумент.Документ.url, "&");
		Для каждого ЭлементАдреса Из МассивСтрок Цикл
			Если СтрЧислоВхождений(ЭлементАдреса, "access_token=")>0 Тогда
				ТокенПользователя=СтрЗаменить(ЭлементАдреса, "access_token=", "");						
				ПодключитьОбработчикОжидания("ОтправитьРезультатВладельцу", 0.1, Истина);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСостоянииеHTMLДокумент()

&НаКлиенте
Процедура ОтправитьРезультатВладельцу() Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Токен", ТокенПользователя);
	СтруктураВозврата.Вставить("СерверПолученияТокен", СерверПолученияТокен);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры // ОтправитьРезультатВладельцу()

&НаКлиенте
Процедура СерверПолученияТокенПриИзменении(Элемент)
	
	УстановитьСтрокуHTMLДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	// Нет.
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьСтрокуHTMLДокумент()
	
	Если НЕ ПустаяСтрока(СерверПолученияТокен) Тогда
		duration = Формат(0, "ЧН=0; ЧГ=0"); //время жизни токена (в секундах) 2592000 (30 дней в секундах) 
		ТекстШаблона ="http://%1/login.html?client_id=TMS&access_type=-1&activation_time=0&duration=%2&lang=ru&flags=7&&response_type=token";
		HTMLДокумент = СтрШаблон(ТекстШаблона, СерверПолученияТокен, duration);
	КонецЕсли;
	
КонецПроцедуры // УстановитьСтрокуHTMLДокумент()

#КонецОбласти
